class Solution {
public:
    int longestValidParentheses(string s) {
      stack<int> st;
      // 哨兵：最近一次不合法的位置
      // (1)-1 不只是防止空栈，
      // (2)它真的被用来算“第一个合法 ()”的长度。
      st.push(-1);  

      int ans = 0;
      int n = s.size();
      for (int i = 0; i < n; i++)
      {
        char c = s[i];
        if (c == '(')
          st.push(i);
        else
        {
           //值入栈了 '('的 idx, pop 的也是 '('的 idx
           st.pop();   

           if (st.empty())
           {
             //  当前 ')'： 没有任何 '(' 可以匹配
             //它本身就是一个：
             //👉 不合法右括号
             //所以：
             //它不能作为合法区间的右端点
             //它只能作为：
             //👉 新的 last_invalid


             // 当前 ')' 无法匹配，作为新的 base
             st.push(i);
           }
           else
           {
              // 当前合法区间长度
              // (last_invalid, i] —— 左开右闭区间
              //长度 = 当前下标 − 最近一个不合法下标？
              ans = max(ans, i - st.top());
           }
        }
      }

      return ans;
    }
};